cf/InformationRegisters/БуферКомандДляСайта_API2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>БуферКомандДляСайта_API2</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КомандаHTTP</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомандыHTTP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРесурсаСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очередь</Name>
					<Comment>Чем меньше тем быстрее уйдет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПовтораПриОшибке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Comment>Когда послежний раз была попытка отправить объект сайту и произошла ошибка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СайтНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сайты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнтернетСтатьи</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнтернетСотрудникиКонтактов</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщенияПользователям</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтзывыОТоваре</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиИнтернет</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнтернетКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Комментарии</v8:Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.МВЗ</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПримененияКоманды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/БуферКомандДляСайта_API2/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбнулитьВсеФлагиОшибок(Команда)
	
	ОбнулитьВсеФлагиОшибокНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаписьСОшибкой()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Объект ИЗ РегистрСведений.БуферКомандДляСайта_API2 ГДЕ ЕстьОшибка");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.БуферКомандДляСайта_API2.СоздатьМенеджерЗаписи();
		Запись.Объект = Выборка.Объект;
		Запись.Прочитать();
		Возврат Запись; КонецЕсли;
	
КонецФункции
&НаСервереБезКонтекста
Процедура ОбнулитьВсеФлагиОшибокНаСервере()
	
	Запись = ПолучитьЗаписьСОшибкой();
	Пока Запись <> Неопределено Цикл 
		
		Запись.ЕстьОшибка 				= Ложь;
		Запись.НомерПовтораПриОшибке 	= 0;
		
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда 
			Прервать КонецЕсли; 
		
		Запись = ПолучитьЗаписьСОшибкой(); КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗапросНаСервере(ОдинОбъект, СайтНазначения)
	текстЛога = "";
	API2.ОтправлениеЗапросовСайту_API2(ТекстЛога, ОдинОбъект, СайтНазначения);
	
	Сообщить(текстЛога);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	текДанные = Элементы.Список.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьЗапросНаСервере(текДанные.Объект, текДанные.СайтНазначения);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтатистику();
КонецПроцедуры


&НаСервере
Процедура ОбновитьСтатистику()
	ТабСтатистика.Очистить();
	
	//считаем только ошибки обработки сайтом (коды 500 и 402)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	БуферКомандДляСайта_API2.СайтНазначения,
	             |	СУММА(1) КАК ВсегоЗаписей,
	             |	СУММА(ВЫБОР
	             |			КОГДА БуферКомандДляСайта_API2.КодОшибки = 500
	             |					ИЛИ БуферКомандДляСайта_API2.КодОшибки = 402
	             |				ТОГДА 1
	             |			ИНАЧЕ 0
	             |		КОНЕЦ) КАК ОшибокОбработки
	             |ИЗ
	             |	РегистрСведений.БуферКомандДляСайта_API2 КАК БуферКомандДляСайта_API2
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	БуферКомандДляСайта_API2.СайтНазначения";
	ТабСтатистика.Загрузить(Запрос.Выполнить().Выгрузить());			 
КонецПроцедуры

&НаКлиенте
Процедура Обновить2(Команда)
	Элементы.Список.Обновить();
	ОбновитьСтатистику();
КонецПроцедуры
